"""
n자리 아름다운 수가 몇 개 있는지 구하시오
1이 1개 연속
2가 2개 연속
3과 3개 연속
4와 4개 연속

오른쪽에 n을 배치하는 경우를 고려하는 문제. DP

1자리는 1 => 1 (1 배치 1)
2자리는 22, 11 => 2 (1 배치 1, 2 배치 1)
3자리는 111, 122, 221, 333 => 4 (1 배치 2, 2 배치 1, 3 배치 1)
4자리는 1111, 1122, 1221, 2211, 2222, 1333, 3331, 4444 => 8 (1 배치 4, 2 배치 2, 3 배치 1, 4 배치 1)
5자리는 11111, 11122, 11221, 12211, 22111, 12222, 22122, 
22221, 11333, 13331, 33311, 22333, 33322, 14444, 44441 => 15 (1 배치 8, 2 배치 4, 3 배치 2, 4 배치 1)


패턴 도출 완료:

1: 1 1 2 4 8 ...
2: 0 1 1 2 4 ...
3: 0 0 1 1 2 ...
4: 0 0 0 1 1 ...

N = 10까지이니까 10짜리의 딕셔너리를 일단 만들어보기
"""

n = int(input())

# Please write your code here.

pattern = [1] * 10

for i in range(1, 10):
    pattern[i] = sum(pattern[i-4:i] if i > 4 else pattern[:i])

pattern_1 = pattern[:]
pattern_2 = [0] + pattern[:9]
pattern_3 = [0, 0] + pattern[:8]
pattern_4 = [0, 0, 0] + pattern[:7]

result = pattern_1[n-1] + pattern_2[n-1] + pattern_3[n-1] + pattern_4[n-1]

print(result)